z_client_xml/addEmployeeRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="https://www.torryharris.com/soap-ws-demo">
   <soapenv:Header/>

   <soapenv:Body>
         <gs:addEmployeeRequest>
         <gs:firstName>Gonu</gs:firstName>
         <gs:salary>48000</gs:salary>
	 </gs:addEmployeeRequest>
   </soapenv:Body>
   
</soapenv:Envelope>
